#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1mdata.aws_subnets.app: Reading...[0m[0m
[0m[1maws_efs_file_system.ga_efs: Refreshing state... [id=fs-0798482ad0444440a][0m
[0m[1mdata.aws_subnets.data: Reading...[0m[0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-074b1768acf554503][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-00ed92986f2772a1d][0m
[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-0ed2efdebd255bf14][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-1522206696][0m
[0m[1mdata.aws_subnets.data: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_db_subnet_group.data: Refreshing state... [id=ga-db-issue-6-subnet-group][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-2372193134][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-3017359774][0m
[0m[1mdata.aws_subnets.app: Read complete after 1s [id=ca-central-1][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_1: Refreshing state... [id=fsmt-03cce43d2cee7d4e8][0m
[0m[1maws_efs_mount_target.ga_efs_mount_target_2: Refreshing state... [id=fsmt-0edb7811ad02cbb5f][0m
[0m[1maws_efs_access_point.ga_ap_root: Refreshing state... [id=fsap-0cf6d1d0881003055][0m
[0m[1maws_db_instance.ga_mysql: Refreshing state... [id=db-QREQBO7OJ2BNPMGOR3SKSRPEVQ][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_efs_access_point.ga_ap_config1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_config1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "config1-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/config1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_config2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_config2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "config2-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/config2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_ghttpsroot1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_ghttpsroot1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "ghttpsrootoot1-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/ghttpsroot1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_ghttpsroot2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_ghttpsroot2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "rghttpsrootoot2-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/ghttpsroot2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_root[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_efs_access_point" "ga_ap_root" {
      [33m~[0m[0m arn             = "arn:aws:elasticfilesystem:ca-central-1:654654488989:access-point/fsap-0cf6d1d0881003055" -> (known after apply)
      [33m~[0m[0m file_system_arn = "arn:aws:elasticfilesystem:ca-central-1:654654488989:file-system/fs-0798482ad0444440a" -> (known after apply)
      [33m~[0m[0m file_system_id  = "fs-0798482ad0444440a" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id              = "fsap-0cf6d1d0881003055" -> (known after apply)
      [33m~[0m[0m owner_id        = "654654488989" -> (known after apply)
        tags            = {
            "Name" = (sensitive value)
        }
        [90m# (1 unchanged attribute hidden)[0m[0m

      [33m~[0m[0m posix_user {
          [31m-[0m[0m secondary_gids = [] [90m-> null[0m[0m
            [90m# (2 unchanged attributes hidden)[0m[0m
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_efs_access_point.ga_ap_sharedconfig[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_sharedconfig" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "sharedconfig-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/sharedconfig"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatlog1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatlog1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatlog1-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatlog1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatlog2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatlog2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatlog2-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatlog2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatserver1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatserver1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatserver1-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatserver1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_tomcatserver2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_tomcatserver2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "tomcatserver2-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/tomcatserver2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_upgrader1[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_upgrader1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "upgrader1-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/upgrader1"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_upgrader2[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_upgrader2" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "upgrader2-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/upgrader2"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_access_point.ga_ap_userdata[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "ga_ap_userdata" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = (sensitive value)
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Name" = "userdata-issue-6"
        }

      [32m+[0m[0m posix_user {
          [32m+[0m[0m gid = 992
          [32m+[0m[0m uid = 994
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/userdata"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 992
              [32m+[0m[0m owner_uid   = 994
              [32m+[0m[0m permissions = "777"
            }
        }
    }

[1m  # aws_efs_file_system.ga_efs[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_efs_file_system" "ga_efs" {
      [33m~[0m[0m arn                             = "arn:aws:elasticfilesystem:ca-central-1:654654488989:file-system/fs-0798482ad0444440a" -> (known after apply)
      [32m+[0m[0m availability_zone_id            = (known after apply)
      [32m+[0m[0m availability_zone_name          = (known after apply)
      [33m~[0m[0m creation_token                  = (sensitive value) [31m# forces replacement[0m[0m
      [33m~[0m[0m dns_name                        = "fs-0798482ad0444440a.efs.ca-central-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m id                              = "fs-0798482ad0444440a" -> (known after apply)
      [33m~[0m[0m kms_key_id                      = "arn:aws:kms:ca-central-1:654654488989:key/982abb8a-c501-4ecb-8827-f6fbcebe208a" -> (known after apply)
      [33m~[0m[0m name                            = "GA-issue-6-efs" -> (known after apply)
      [33m~[0m[0m number_of_mount_targets         = 2 -> (known after apply)
      [33m~[0m[0m owner_id                        = "654654488989" -> (known after apply)
      [33m~[0m[0m performance_mode                = "generalPurpose" -> (known after apply)
      [31m-[0m[0m provisioned_throughput_in_mibps = 0 [90m-> null[0m[0m
      [33m~[0m[0m size_in_bytes                   = [
          [31m-[0m[0m {
              [31m-[0m[0m value             = 6144
              [31m-[0m[0m value_in_ia       = 0
              [31m-[0m[0m value_in_standard = 6144
            },
        ] -> (known after apply)
      [33m~[0m[0m tags                            = {
          [33m~[0m[0m "Name" = (sensitive value)
        }
      [33m~[0m[0m tags_all                        = {
          [33m~[0m[0m "Name" = "GA-issue-6-efs" [33m->[0m[0m "ga-issue-6-efs"
        }
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m protection {
          [31m-[0m[0m replication_overwrite = "ENABLED" [90m-> null[0m[0m
        }
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_1[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_1" {
      [33m~[0m[0m availability_zone_id   = "cac1-az1" -> (known after apply)
      [33m~[0m[0m availability_zone_name = "ca-central-1a" -> (known after apply)
      [33m~[0m[0m dns_name               = "fs-0798482ad0444440a.efs.ca-central-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m file_system_arn        = "arn:aws:elasticfilesystem:ca-central-1:654654488989:file-system/fs-0798482ad0444440a" -> (known after apply)
      [33m~[0m[0m file_system_id         = "fs-0798482ad0444440a" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id                     = "fsmt-03cce43d2cee7d4e8" -> (known after apply)
      [33m~[0m[0m ip_address             = "10.210.67.9" -> (known after apply)
      [33m~[0m[0m mount_target_dns_name  = "ca-central-1a.fs-0798482ad0444440a.efs.ca-central-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m network_interface_id   = "eni-0f5ef7330825c879c" -> (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_efs_mount_target.ga_efs_mount_target_2[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_efs_mount_target" "ga_efs_mount_target_2" {
      [33m~[0m[0m availability_zone_id   = "cac1-az2" -> (known after apply)
      [33m~[0m[0m availability_zone_name = "ca-central-1b" -> (known after apply)
      [33m~[0m[0m dns_name               = "fs-0798482ad0444440a.efs.ca-central-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m file_system_arn        = "arn:aws:elasticfilesystem:ca-central-1:654654488989:file-system/fs-0798482ad0444440a" -> (known after apply)
      [33m~[0m[0m file_system_id         = "fs-0798482ad0444440a" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m id                     = "fsmt-0edb7811ad02cbb5f" -> (known after apply)
      [33m~[0m[0m ip_address             = "10.210.112.135" -> (known after apply)
      [33m~[0m[0m mount_target_dns_name  = "ca-central-1b.fs-0798482ad0444440a.efs.ca-central-1.amazonaws.com" -> (known after apply)
      [33m~[0m[0m network_interface_id   = "eni-05e76c46881db180d" -> (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 16 to add, 0 to change, 4 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mathieupetersonGC, Action: `pull_request`*